{
	"entries":[
		{
		"date":"06/01/2015",
		"title":"Week 1 Day 1",
		"text":"Today was the first day of our code camp. We started off with general introductions.<br> Our first lab focused on a python script using tweep from the twitter api. we discussed importing specific items from different python files. We created a new gmail account, a new google phone number, and a new twitter account,we were able to review some python script and modify it so it would send out tweets to our newly generated twitter page. Then we reviewed a second file so that it would take our file and tweet out random lines from our file. I learned not to use tab and to use spaces instead (I normally used tabs). I also learned how to stop the command line from running by using control-c.We then met to discuss source code control programs and that git would be our main program to use. We breifly touched on it and then were assigned a lab. I am struggling with using git and this lab. I have gotten the hang of initializing a repository(git init), changing a file, adding the file to be changed (git add),and then commiting a file (git commit). I have to figure out how to do it remotely yet and how to use Source Tree as that was a disaster also. Git is going to take some getting use to but I know it's a big deal. "
		},
		{
		"date":"06/02/2015",
		"title":"Week 1 Day 2",
		"text":"Today was the first day of our code camp. We started off with general introductions. Our first lab focused on a python script<br> using tweep from the twitter api. we discussed importing specific items from different python files. We created a new gmail account, a new google phone number, and a new twitter account, we were able to review some python script and modify it so it would send out tweets to our newly generated twitter page. Then we reviewed a second file so  that it would take our file and tweet out random lines from our file. I learned not to use tab and to use spaces instead (I normally used tabs). I also learned how to stop the command line from running by using control-c. We then met to discuss source code control programs and that git would be our main program to use. We breifly touched on it and then were assigned a lab. I am struggling with using git and this lab. I have gotten the hang of initializing a repository(git init), changing a file, adding the file to be changed (git add), and then commiting a file (git commit). I have to figure out how to do it remotely yet and how to use Source Tree as that was a disaster also. Git is going to take some getting use to but I know it's a big deal. "
		},
		{
		"date":"06/03/2015",
		"title":"Week 1 Day 3",
		"text":"Today was mainly focused on building our dice game which I thought was awesome given how complex we made the rules. We did two lectures focused on loops (for and while) and string manipulation. Seeing as how I had researched for in loops and while loops to work in my dice game this was a good review but I did learn a few different commands. The break and continue commands will be helpful. Continue will end a current iteration and jump back to the start of the while loop and run again. A break will end the while loop that you are currently in.. When dealing with string manipulation, I learned about using str.find() which find the first occurrence of an item. strings.lstrip, .strip, .rstrip remove whitespace from a string (strip will remove it from both sides) None of them remove whitespace from the middle of the string inside of the quotes. I didn't know about the  .startswith and .endswith functions. The .replace function will replace all occurrences of a string which I thought was interesting. I also learned that these functions do not modify the item we are running it on, but create a new string for each which we can store in another variable.. In my dice game, I've learned mainly about loops, string formatting, and how to return information in functions. String formatting command is simply {}.format(my variables I want to replace).  Here is an example: {0:15}{1:^15}{2:^15}.format(player[0],player[3],player[4]) I tried calling the same function within itself but it doesn't seem like it will work, but I'll keep trying. . I've also learned I can get lost in my own code so I need to make smaller chunks of code and document it better and name my variables better because there were a couple of times I really had to think as to what I was doing.. Debugging is also a pain trying to go through the game many, many times and figure out it it actually works for all situations. Printing out each and every step helps alot.. Today was a satisfying day for me because I felt like I broke through and mainly completed my game. There was a  point where I wanted to just say good enough and stop, but I took a break and re-focused and broke through that barrier.. I'm excited to see my finished product tomorrow."
		},
		{
		"date":"06/04/2015",
		"title":"Week 1 Day 4",
		"text":"Morning - Finished up the lab from last night and re-did the modular arithmetic problem.. The problem asked to output YUP if an inputed number divided by 10 was within 2 of a number that ended in 0. Because of how floating points work,  when decimal numbers were added, I was getting incorrect results. By importing the Decimal module and creating decimal types for my numbers, I was able to make the precision less and the program worked.. We learned about functions with our normal lecture and were then asked to create a function to calculate our pay for a given week based on user inputed hours and pay rate. The function asks us to use overtime hours in our calculation. I was able to use successfully for the first time the try except and have it run repeatedly by re-asking for the user values and return the raw_input function on the except. I was also able to format the function to two decimal places by using the {0:.2f}.format(total_pay) (total pay was my variable which stored my total_pay). The 0 is the placeholder spot for total_pay and the .2f tells .format to go to 2 decimal places and make it a float.. I was able to work my own project for a bit concerning my data science goal by making a python program that will output the number of degrees of freedom from a directed graph. Hopefully, I'll get to work on this some more as the class proceeds.. The afternoon was spent working on a dice game we created as a group and then individually, we were sent to make a program for it. so far my biggest lessons is using a for in loop over a list. Storing each players information as a list has been helpful. Also, I created a DICE list storing each die we use and giving that to each player. This was a mistake because when I updated each player's dice list, it updated all of the players so I had to make sure each player had their own individual list. We did not make this game easy on our selves because we have to keep track of scores assigned to the dice during the game. This is challenging.. Finally, when committing to git hub I need to remember that if I create a READ ME file from adding a repository on git hub, I need to first pull the repository or clone it to my local spot and then push it. Also when adding the remote repository I need to make sure to use the command git remote add origin  url where url is the location of my git hub remote repository.. I have a feeling I will be working on this program a bit tonight so my night isn't over yet!. "
		},
		{
		"date":"06/05/2015",
		"title":"Week 1 Day 5",
		"text":"Today was focused more on reinforcement and reflection. We had more time to finish our dice game and I was ableto finish up debugging for my computer player..  One major tool I learned today was concerning list comprehensions. I was happy to learn about the enumerate function which creates a list mapping our values to different indexes which when used with list comprehensions make it easy for me to get multiple max or min values from my lists. List comprehensions allowed me to create lists in single lines of code rather than multiple blocks.. We had a lecture on Google searching and this was helpful to know what a more efficient way to was to search in Google. It was interesting to know that the simpler we keep our search terms the better results we will get.. We reviewed our labs today to verify they were correct. Andrew reminded me about the split command. I can use this to break apart an email address and then verify it's in the correct format. Also I could have validated the first letter for a character rather than making sure it wasn't a digit, but either way worked fine.. We did a whiteboard challenge called fizz buzz. I forgot to use modular division at first instead of integer division but Andrew let me work through it and I finished the problem.. Main point driven home today is simpler, more modular codes put inside smaller functions to help me develop smarter and easier to debug code.. I finished Lab 4 on Loops with nothing too new to go over as most of what we have done were involved in our Dice Game."
		},
		{
		"date":"06/08/2015",
		"title":"Week 2 Day 6",
		"text": "The second week began with Nick instructing us how to post our reflections blog to our github.io pages. Very interesting to know how to do this. It was great practice to use git again to set up repositories and push and pull. I was able to look at the code they provided and even though it was JavaScript and HTML I felt like I could at least understand what it was saying (not the commands) which is encouraging. We entered in our entries as JSON objects and it was here that I learned to be very mindful of sytax and punctuation like double quotes or single quotes that could become problamatic. After all was done, we got our blog posts up and we set off to work on some labs. I am currently working on a problem to spell out all numbers from 1 to a minimum of 1 million.. We then had a very interesting lecture on OOP or object oriented programming. Very awesome. Using classes and child classes to arange as many instances I need of an object would have come in very handy for our dice game. The key terms I would like to learn more about are encapsulation and polymorphism because they didn't qutie stick in my brain at first when he intruduced them. Using the keyword self made sense and init (instantiate) the object also finally clicked for the first time as I had heard them discussed before but couldn't ever put it into practice.. A few other quick notes on the lecture were methods and attributes (attributes describe the object) and methods take action or do something to the object. Finally getters and setters where getters return values from an object and setters set values from the object.. We were then given a task to create an item from our back pack or from the room and turn it into an object and make methods and attributes on it. Unfortunately I choose granola bar and given what we learned next, this wasn't the best choice. What we did learn next is that we would be creating a game based on the objects we created. As a team we had to come up with the rules and game play and then as a group develop the game. As you can see oatmeal was a bad choice.. We created the rules on one board and then pseudo-coded our class file on another. When we finished, it was quite hard for us to determine who should do what and how to proceed next seeing as how most of us had never worked in a collaborative environment before in the programming world. We decided to each try and develop some of the initial class code and then we would review it and discuss. As we broke off, we had to set up a repository again on Roberts computer which would be considered our master and then we would fork his repository over and work from that. This was a bit difficult doing for the first time but Nick helped us through the command line prompts and we got some more practice.. The rest of the day consisted of us tinkering with the player class code for our game. Upon reflecting (and what we should pobably do for tomorrow), we need to accurately decide inputs and outputs for certain functions and then assign them to people so that no matter how they solve the problem it won't matter. Also breaking our code into seperate files will help with revision control. There are alot of leasons to learn from this that I'll report more on tomorrow as we go through this collaborative experience."
		},
		{
		"date":"06/09/2015",
		"title":"Week 2 Day 7",
		"text": "Today was split into three parts for me. We started out working on the game..I completed my initial portion which finally allowed the rest to get started. Working in a collaborative environment was difficult but I feel like a great learning experience. It's tough because we are still learning, but I think we need to learn how to work in a group and think in terms of black boxes and inputs and outputs instead of processes initially.. We had a fun lecture on bits and network speed that I really did enjoy. (I wasn't being sarcastic). I think it's great to get a more basic knowledge of how computers function.. We then got back at the game and I was able to complete the timer function for our inputs. I learned about threading briefly and I think I want to touch that on another time, but I found a great stack overflow article that explained counters and how the loop would constantly check the time and after 15 seconds the loop would stop after using the msvcrt module. We had a great presentation from WennSoft where their hr manager told us what she looks for and their interview process. This was VERY valuable because I really was curious to hear the other side of things. Knowing references are becoming less used now a days was good news given my career change. Also getting another perspective on how long interview processes take was beneficial to hear. Finally, I wasn't aware they did a technical test that early in the process so now I know to ask about this ahead of time.. We finished up the day by working on our game and after our scrum meeting we learned that we were struggling because we never assigned a project manager. This definitely confirmed some of the struggles we were having. I think we are close though as the main game logic is coming together. It's neat to see a project come together however, I still don't understand all of the pieces of the puzzle yet. We will have it finished by tomorrow. Looking forward to getting some rest tonight that is for sure. "
		},
		{
		"date":"06/10/2015",
		"title":"Week 2 Day 8",
		"text": "Today was focused into two sections. The first dealt with us finishing our game between objects. Our main goal was to debug our program and add in some functionality involving my playerClass. I have learned working in collaboration really involves communication and teamwork in a computer science discipline. For example, I had what I thought were changes done to my file but because I was interacting with other files, changes my teammates made required me to make additional changes. Git(revision control) and teamwork were EXTREMELY important... For the first section of the afternoon I focused on completing a lab question. I wrote a small program that would tell you if it was dark outside based on the time of day and time of year (basically it took the month and compared it against approximate sunrise and sunset times.). The rest of the day has been spent on getting started on our first personal project. Mine is a simple program that will take stock option data for a symbol and allow me to record how the price moves throughout the day. I want to include an interface with it but my goal is to get it to work with one stock and then apply it to a range of stocks from there. I've been frustrated at the moment because I can't seem to find any good libraries or modules to accomplish this.. My main struggle has been trying to install the pandas and matlab module so I can actually do something with this."
		},
		{
		"date":"06/11/2015",
		"title":"Week 2 Day 9",
		"text":"I finished my personal project today for my options web scraper project and I am pretty excited about this. I was looking at creating a program to gather all of the options expiration data for particular stocks minute by minute. I created a console program that does this and I am working on building a GUI interface so users can easily do this as well.. I learned some pretty valuable lessons from this. The first was to lay out your plan first and then focus on designing the minimum functional product first and then add functionality to it once you accomplished the task. Very important lesson to learn in making sure you meet a project deadline. Secondly, I was taught a valuable lesson about modules. There are a million modules in python and they are not created equal. Some are very difficult to install and when making a project that needs to be completed by a deadline, if a certain module is not meeting your needs. Switch your scope and try another one..Learning how to scrape the web was pretty fun and interesting to me. I was able to pull data from a website using beautifulsoup and requests and it is a powerful tool to use especially for machine learning and data analysis from the web that I plan on using in the future. Outputing the data received to json or csv files after is also valuable. The better and cleaner the data is on output the easier it will be to use after. Finally, I used a module from python that allowed me to create a user interface. While I thought it saved me time, I am still not sure I made the right choice here because once I had to do some customizing, I had to learn how to use the original module used in designing it so I am not sure I saved any time. Just something else for me to think about..Today felt good to accomplish my project and finish my labs so I am looking forward to finishing up the week on a high note tommorrow and put week 2 in the books!"
		},
		{
		"date":"06/12/2015",
		"title":"Week 2 Day 10",
		"text": "After another night debugging my personal project I finally think I have my first iteration done!  In an example of how far I think I have come in two weeks, I had never known we could open up more than one command line prompt windows to run multiple files at the same time. Knowing little things like that are second nature to some, but for me learning that little trick was so cool!  Just goes to show me that I have so much to learn. Anyway, my project collects options expiration data and spits it out into a csv file that I import directly into excel. I have set up a list of items for me to improve on and the first of which is going to be to import the matplotlib, numpy, and pandas module so I can do my analysis directly! Speaking of those modules, I had my biggest breakthrough today regarding installing them! When I first began my project I had a the hardest time using installing these modules because they are supported by other modules and those also need to be installed first and they have to be installed in the right user directory. I spent some time really digging into how these modules should be installed correctly. For one, the easiest path I should have done was install an encompassing program like Anaconda that installs all of these for me directly. I have to be careful here because this may set up multiple python installations for me so I have to watch where I install this(I learned this the hard way). Secondly, if using pip install or pip install upgrade does not work, I can directly install something called the binary file(the module by itself) by either its wheel file or tar file, and then install it by using them. (I love that I can use some of these technical terms now). Well, enough about modules for now, but needless to say I had some big breakthrough in installing them! One final note from my morning session. I did a tutorial on a graphical user interface called Kivy for python to hopefully help get a better GUI interface for my program. I am going to keep playing with this because TKinter does not give the look I am going for. Plus, since event driven programming using GUIs is different in programming than providing console programs, I am going to keep on looking to improve my skills for this type of programming.."
		},
		{
		"date":"06/15/2015",
		"title":"Week 3 Day 11",
		"text": "Game Day. We learned we are building a classic arcade game similar to Asteroids. We are being led by one of 1st groups members and Brandon had a great kick-off meeting. Our first assignment was learning about the module called Pygames in python. I had initial trouble installing the binary file but with my previous experiencing installing modules for my personal project, we were all able to get it installed. One very important lesson I have also learned is all tutorials are not created equal. I had trouble initial learning about how to use the various methods in pygame so I purchased a kindle book to help me out and it was very helpful. The book was Building Arcade games for Python using Pygames and it explained how to use sprites and help with collision detection. The rest of our day was filled with dividing up our task and figuring out how to collaborate. This was an achilles heal for us the first time so it will be nice for us to give this a second shot. My task is to build our ship class so I get to use some of my math knowledge to build how the ship will fly. My goal is to have this completed by the end of the night!"
		},
		{
		"date": "06/16/2015",
		"title": "Week 3 Day 12",
		"text":  "Game Day part 2. After a long previous night of finishing reading Pygame for Arcade Games, I finally think I have a handle on collision control with sprites (or at least I thought I did). After getting my ship class to fly, I thought it would be a piece of cake to have my ship collide with some asteroids. Boy was I mistaken. After hours of trial and error, I discovered that pygame uses the sprite image and determines and x and y coordinate separately called rect-x and rect-y which it uses for collision detection. Wow...I relooked at my notes and sure enough it was starring me in the face. Sometimes I just need to do a better job of framing my problem before powering through an issue.. We also learned about AGILE and how it corresponds to a workflow environment. This was very interesting to me because of how similar I found this to the LEAN work environment. In the design engineering world we do things similar but it was awesome to see how our workflow would be! Our afternoon was filled with getting our daily build complete and merging our files together to hopefully have a working build. I think we have completed this and feel good about leaving for the night."
		},
		{
		"date": "06/17/2015",
		"title": "Week 3 Day 13",
		"text":  "Game Day part 3. DANG! We began the day in a much worse spot than were we left it. When we left last night, it seemed like our files collaborated nicely but it turned out we were all tinerking a bit in each others files and not merging our repositories together. Turns out our merging did not go smoothly and none of our files work correctly. This led to us having our daily meeting and much frustration (not at each other but with a lack of understanding how to work in a group) After talking it over we developed a new strategy with more communication and with us creating a new clone of our repository and with us only pushing our files we worked on and us pulling all of the files first before we commit and merge to verify our files work. By using source tree we are then able to see when pulls and updates have occurred. A huge breakthrough for us and a major learning milestone reached for learning to work collaboratively. We fixed our files and were able to get back to where we were last night with our ship flying around on the screen with asteroids. We then worked on getting our asteroid class working, a bullet class, and finalizing our graphics. We ditched using the built in sprite collision for now as our own method of calculating the location seemed to work better and at the end of the day we got the bullets to remove the asteroids!  What a great feeling that was! We also learned that having excessive print statement can really slow down a game utilizing graphics. It was a great end to the day after I began it feeling so lost. "
		},
		{
		"date": "06/18/2015",
		"title": "Week 3 Day 14",
		"text":  "Game Day part 4. After yesterdays great progress we continued onward to finish with our initial build. We all set out on our tasks to finish getting our part of the project completed for our initial build. My specific part focused on integrating sound into the game. I learned that .mp3 files do not always play in pygame so I had to use audacity (a free sound converter) to either convert them to .ogg files or .wav files. Our instructor Andrew told me about soundcloud for downloading free music and I scoured that website as well as freesound.org and open game art.org."
		},
		{
		"date": "06/19/2015",
		"title": "Week 3 Day 15",
		"text":  "Game Day part 5. Time for us to finish our game! We met this morning to determine our final tasks to finish the game. I noticed a bug with my sound for the missiles and thrust so that was my first task in fixing. Secondly, I wanted to add rules to our options page so users could know how to play. If I had time, I was going to try and add a two player game. Fixing the sound required me to add a stop function on the main game loop when the game ends. Adding the rules section proved a little difficult as I had to interact with our options page and then blit(a term used for printing text to the screen) the rules. Formatting this text is difficult as if each line is not the same amount of characters then I have to figure out the exact amount of x y spacing to line it up. This was a pain. After figuring this out, we finalized the power ups and our game works!  It is a pretty cool feeling seeing a finished product. We visited PKWare at lunch and got to see one of the most unique environments I have ever seen for a business. Really helpful to hear from some of the junior developers on their advice and how they got started. My biggest takeaway was how they are looking for passion and if you can show that, they are willing to take a chance on someone just getting into the field. This was a very helpful visit. The rest of the day we finished up with tinkering with our game some more and making sure we understand it. I learned alot with python and feel ready to take on JavaScript."
		},
		{
		"date": "06/22/2015",
		"title": "Week 4 Day 16",
		"text":  "On to Javascript! Actually more like onto HTML and CSS for the morning.  While I am sad to see Python go in our rearview mirror (well, just for now), I am excited to dive into some new languages. We started with a few lectures on CSS and HTML and in the process we were challenged to do a few introductory labs. These labs got our feet wet with the language and helped us to start looking on the web to determine how to use CSS together with HTML. I found W3schools to be a good resource as well as Mozilla. The box model was one of my trickier concepts to understand. I found the box-sizing property to be a very useful tool to use. Essentially this puts the border, padding, and content all in the width where before if we added border to our content it would resize our box. I then had my final python evaluation and I felt I did well overall. I got one question incorrect, but it wasn't a terribly big error. We had a final lecture on CSS and then proceeded to tackle another lab. This lab was focused on using our new found skills to enhance our blogs using a template they had provided. Utilizing new CS3 and HTML5 features I added a 3-d text shadow, added a video you tube embedded element, background image to my contact section, and other various odds and ends. The 3d element utizles the h-shadow and v-shadow attributes together with the size and color schemes to achieve the result I was after. We got to play around with these files for a long bit and then presented them to each other so we could learn some new ideas and tricks. Everyone did well and I will definitely take away the text-shadow feature for future use. We finished the day with an introduction to JavaScript specifically going over the console.log print method. I learned about debugging in the developer tools (F12) by going to the source area and from there you can start or stop a script. Very useful. Finally, we learned about the operators and operands available in Javascript. A new lab is available for us so that will be what I will focus on next. Until next time!"
		},
		{
		"date": "06/23/2015",
		"title": "Week 4 Day 17",
		"text": "Labs and more labs. That was my theme for the day. It started out well as we were given more lectures on the syntax of JavaScript and how it interacts with control loops. There is definitly a differnce from Python! The for loop is different in JavaScript and I especially love the for loop. Here we explicitly state our dummy counter variable, then when it should end, and finally how to increment it. I love it! However, I wasn't happy with the for in loop of an array because that functionality is different from Python in that it only loops through the index of the items and doesn't directly import the collection items. I found the forEach function very useful as that would loop through and do a function on each item in the array. That I found very useful.. The day went well until I reached lab 5 which had us create an object of different family members which included information about them, particularly their birthday. We had to return how long in months, days, minutes, and seconds until their next birthday. This really, really, really tripped me up. I was thinking about it too specifically where I was trying to account for leap years and the difference in the month's days. I used the computer time in miliseconds and subtracted the difference between today's date and then figured out the time difference for each unit. I used arrays storing the months days to figure out the different days in a month. Gosh that one really got me. We also had a fun coding challenge where we had to write up 6 functions to solve 6 different problems and then with a partner we had to disguise a single function so others couldn't figure it out. I was able to solve all 6 problems but I did a terrible job helping my partner create a function that disguised what we were doing. I was useless there. I need to become better at thinking creatively on the fly. Well, I'm glad this day was over. Hopefully tomorrow is more succesful."
		},
		{
		"date": "06/24/2015",
		"title": "Week 4 Day 18",
		"text": "After yesterday's debacle with the date and time lab, I started the morning off right by getting my lab approved and succesfully completed the next lab on functions. Gosh, what a difference a day makes once you clear your mind. We had a lecture on forms and in our next lab we were tasked to use JQuery without actually being taught it. This was a good opportunity to visit the wonderful jQuery website and start learning from their documentation. As I said earlier, today was much more succesful as I was able to comlete the lab.. I learned that if you are not submitting a form, you must either cancel the form submittal by returning false in the function or use e.preventDefaults() to stop the page from refreshing. Secondly, I learned about the filter function and how I could filter through a large amount of inputs or any other element tag in a document. I used that to solve the final lab for verification that all items were filled in.  We had a lecture on jQuery to re-informce what we worked on in the lab and then we had a few lectures on domain name's and how the internet works. Very, very, very interesting as I never realized how the internet was routed and how we got our information. We finished the day by getting another lab and this one has started out tricky. It seems my blog generator works only in firefox and not chrome. I will investigate this tomorrow. "
		},
		{
		"date": "06/25/2015",
		"title": "Week 4 Day 19",
		"text": "Lab Time! Wow, this lab is difficult. I made the initial part of the lab more challenging than it needed to be as I found out there were some errors with the postgen file so I don't need to set up a local web server, but it was nice to do some of my intial research on the topic for my own learning. The generator works with firefox so I can do my debugging there. However, we ran into another issue where the source file it generates isn't valid json because it takes the br tags and converts them into line breaks when it spits out the source code. I probably spent too much time debugging that issue as I will most likely just format after the fact for now. Anyway, I went to work on finishing my pagination. I used a jQuery plugin called bootpag. I copied the default js code they provide and then linked it to a div in my index file and I had my buttons. After much debugging I found out the page numbers on screen can be passed into my script function and I can place this script function anywhere in my script and it will activate when a button is pressed. So after getting my pagination I was onto my search function and unfortunately this was more difficult than my pagination! I learned two important things. One is I need to make sure I declare my variable even inside a function because I didn't and I reused a variable in another function and because I didn't declare it, it made my score global on the first variable and then it passed in those values on the second. My second lesson focused on function scope and how I need to be mroe dilligent in passing values and returning them to make my code more modular. I used another jquery plugin called highlighter to highlight my text on search. Tomorrow I need to make my finishing touches to finish this project off. Long day."
		},
		{
		"date": "06/26/2015",
		"title": "Week 4 Day 20",
		"text": "Friday. Figuring out how to do pagination is much more difficult than I ever imagined! I also never dreamed searching for characters and words would be so difficult. Plug-ins were very helpful for me, specifically the jquery highlight plugin which allowed me to highlight the word I was searching for. AJAX calls are especially troubling for me as I'm having a hard time retrieving the data from them. I have to wrap all of my functions pretty much in the .get function so I can retrieve the data. I raelly need to learn more about how to use callbacks with AJAX functions."
		},
		{
		"date": "06/29/2015",
		"title": "Week 5 Day 21",
		"text": "Our new project was given to us today. It's a group project where we are tasked with designing a site similar to survey monkey. A major challenge will be the dynamic nature of the user input. Another huge task will be figuring out how to use the interaction between python, javascript, and mongodb considering this is far outside of the scope of what we've done before. Our work is cut out for us in this one!"
		},
		{
		"date": "06/30/2015",
		"title": "Week 5 Day 22",
		"text": "Chomp Day 2. The name our group gave our site is Chomp. I like it! Tasks were distributed and my focus will two fold. First, I need to create a script that builds a web page based on a JSON object that we create when our admin builds the page. Secondly, I need to actually create a dynmaic page for the server admin to create a survey from. Just typing this out now, I see why today was a long day as the dynamic portion of this was a challenge. Since the admin user can create and add entries, my div id's and header numbers can get out of whack so I needed to come up with a way for the page to resort itself. By the end of the day I used JQuery to resort the page and I basically made a copy of the HTML file, replaced the elements, and then pasted them on the page. Here's for hoping day 3 is a shorter day!"
		},
		{
		"date": "07/01/2015",
		"title": "Week 5 Day 23",
		"text": "Chomp Day 3. Today was focused on creating functions to use to get the information from the user to store as a JSON file so that we can store this in our database. We also needed another page to take the users results and display them to the admin. This worked surprisingly well given my previous two days. Finally, I learned how to interact with our data through MongoDb and create new collections and different data types. The project is progressing forward!" 
		},
		{
		"date": "07/02/2015",
		"title": "Week 5 Day 24",
		"text": "Chomp Day 4. Our code is growing. I think our team works well in a collaborative environment and we communicate effectively about when we push and pull from using Git through Source Code. We have yet to have any major issues with source control. I am struggling to figure out how to dynamically call back some of the builder functions. Since I explained on day 2 of this week how I stored the html page, it's since given us an issue where any input values are not properly displayed back rather they are displayed using their default value. Looks like my dynamic builder will have to reconstruct the DOM tree given the JSON file rather than my quick fix of storing the HTML. I've also had to get into the mongoDB and python side of things (using the flask module). The getMaxID function given to us in our helper files doesn't get the Max ID because of the way JavaScript sorts. It sees 11 as a lower number than 9 because it compares 1 first against name (1 being the first digit) and it returns that 9 is greater. I had to create my own way of sorting the values in order to make the automatic generation for our survey ideas to work. Looks like my 4th of July weekend will be spent coding but I'm okay with it. This has been a fun and challenging project." 
		},
		{
		"date": "07/06/2015",
		"title": "Week 6 Day 25",
		"text": "After working on our project over the weekend, we had until lunch to finish it up (for better or worse). I was proud of what our team accomplished as we were able to get a mostly functional survey builder that allowed for customization. To achieve what we did was truly amazing (in my opinion). Ajax calls still frustrate me as a solution to getting my data simply required me to add a for loop which I assume slowed down the function callback just enough so I could get my data. I will have to become more familiar with these calls. Also, I ran into an issue with access my mongodb data because my collection at home became corrupted on a bad shutdown of my computer. Repairing the collection and database seemed to fix that issue. Overall I enjoyed working with javascript but there are a few issues I will be glad to put behind me. One big one is how it sorts numbers (this may be all programs) but I would have thought 9 would be less than 10 but because of how it evaluates the data (it compares 1 to 9 first),  it doesn't sort as expected. I'm excited to learn about C#."
		},
		{
		"date": "07/07/2015",
		"title": "Week 6 Day 26",
		"text": "Today we began our adventure in C Sharp. The morning was filled with our introduction lecture on C# and I use the word introduction very, very, very loosely as we began exploring object oriented programming in the language. Most of our time was spent on the organization and creation of objects based on constructors. Inheritance was a major focus and how we can inherit methods and properties through using parent classes. We learned about interfaces and abstract classes and when to use them. This was some tricky stuff. We ended with some lecture time focused on overriding (a way for us to use the same method for different child classes but with different functionality), overloading (a way for us to pass in different arguments for the same function) and polymorphism. Finally we learned about the solid design principles. S - Single Responsibility Principle, O-Open/Close Principle, L - Liscoff (sp) Substitution Principle which states any child class should be able to replace any parent class. I-interface Segregation, and D-Dependency Inversion Principle. After lunch we were given the task to build a constructor object that would build a robot using parts and a powersource. Getting a template down in the beginning has proved challenging but once a method has been determined, it has become easier to create all of the different objects and now the hardest part is trying to use my creativity to generate what I want my robots to be."
		},
		{
		"date": "07/08/2015",
		"title": "Week 6 Day 27",
		"text": "More great lectures today as well as more time for us to work on our robot project. We had to construct multiple robot classes that inherited from interfaces and abstract classes that would allow us to interact with these robots. A key component was that each robot had to have one powersource and could have many, different parts. Difficult to say the least. We present our final projects tomorrow morning. We learned about the SOLID principles in depth and we also learned about complex data structures and generics and attributes and the like. My head is definitely hurting at this point. We learned about concepts like polymorphism and overloading and overriding. We learned about error catching and handling using try catch statements. I could go on and on, but I need to go home right now to rest up for tomorrow!"
		},
		{
		"date": "07/09/2015",
		"title": "Week 6 Day 28",
		"text": "I realized I forgot to mention we learned about UML diagrams as well so I had to create one for the project. Here we learned about dependencies and the has a or is a relationship. We learned how to construct these diagrams and had to present one for our robot project. We also learned all about testing and unit testing in depth. We learned about the different types of tests (functional, etc) and how to use the unit testing environment in visual studio. We needed to create unit tests for our robot and for what will be our next project which is to build a calculator using inheritance, that needs to be unit tested, and that also has to include a proper UML diagram. We also had another lecture on simple data structures like lists, arrays and things like that. We learned about what types of data structures are pass by value and pass by reference. Again, my head hurts."
		},
		{
		"date": "07/10/2015",
		"title": "Week 6 Day 29",
		"text": "Review and Testing. We had a great review session that covered most of the topics we discussed during the week and were able to work on our calculator projects for the day. The testing was pretty intense and our last project for the test was to recreate a project using a UML diagram that had many one to many assocations listed on it for a bank with branches. The key was set up a property that stored lists of banks and customers to ensure this relationship. We then had to write a function that the instructor selected in the class. Mine was calculating compound interest for a customer."
		},
		{
		"date": "07/13/2015",
		"title": "Week 7 Day 30",
		"text": "With the previous week of learning behind us, our project for today was to revisit our lemonade stand and build a console project in C# that allows us to incorporate weather, demand, suppliers, pricing, shipping, and even GPS coordinates into our project. All of this needs to be done by tomorrow morning. I was the group project leader for this and we assigned tasks and set forth on building the game flow, classes, and console interaction needed. With such a quick turnaround needed on a project like this, it was key that we stayed on task and didn't worry about the smaller details. If we could sell one lemonade cup I'd be happy. Main problems focused on just getting started so we didn't drown in the details and also, how were were going to incorporate the logistics of tieing together ingredients, customers, and suppliers. My team did a great job on creating the proper classes and interactions needed. As the lead for this, I took what we had by the end of the day and created the necessary game loop to run this project from it. It's real late tonight, but we have a shippable project!"
		},
		{
		"date": "07/14/2015",
		"title": "Week 7 Day 31",
		"text": "Vendor Management Project Day 1: We got our project for the week and as a group we are to basically create an ERP system for a vending machine company. We were told about the project and then immediately had to construct a game plan which is very, very difficult to me because I like to think about things in general a bit first before rushing in. We pitched our requirements and what we thought we could get done by the end of the week which involved some basic accounting features, a graphical user interface, exporting options to csv and pdf and some reporting features. We would give additional features if we had time. We began the day constructing our classes with Matt handling the graphical user interface and building the windows form, Mike working on constructing a fake database for us with a database class, and myself constructing some controller classes that would handle the inner workings such as the machine and product classes for each. It began much like most projects, slowly as we figured out our requirements and where to go. We were told we basically fell into the MVC design protocol which was nice to hear (Model View Controller)"
		},
		{
		"date": "07/15/2015",
		"title": "Week 7 Day 32",
		"text": "Vendor Management Project Day 2: I forgot to mention from our lemonad stand project how well we have adapted to using source control with visual studio. Still no issues. We are really good at communicating if we have added new files so each of us can update our csproj file and we have had no major issues to date. I continued on the path of building methods and properties for the machine, product, employee, vehicle, etc classes so they could be used to handle our interactions with our database and form. Mike and I discussed how to properly handle transactions and we developed basically an accounting system which debits and credits our transactions. We also came up with ways for us to show restocking the product and with Matt's interface, I feel like we are making good progress. I started on generating our report maker class so that we could start to pull data from our fake database. The key items I learned were creating datatables and using linq to query our fake database to then generate whatever datatable we needed. I then had to work on formatting these tables to our screen but the results were very positive! I felt good about this day."
		},
		{
		"date": "07/16/2015",
		"title": "Week 7 Day 33",
		"text": "Vendor Management Project Day 3: Another great day. We are complete with our minimum viable product. We have about 9 reports and other various data screens that the customer can filter on to see our results. Mike built a great transaction controller class which additinally would add or remove machines based on the data tables I generated. Matt created a great user interface and started constructing our exports for pdf. I helped write the code for exporting .csv files which Matt took and finalized for each report. I'm really, really happy with the product thus far as already we have a shipable product for a basic ERP system that is pretty flexible."
		},
		{
		"date": "07/17/2015",
		"title": "Week 7 Day 34",
		"text": "Vendor Management Project Day 4: We have all been working pretty hard and late nights on this project so they gave us the day to finish up to present next Monday for the new incoming class. I completed a Service request form together with an option to print or save a new service request for each item. Additionally, we did some error checking and then wrote some unit tests for our project so we could have our completed functionality to present to our fake customer on Monday. Matt was finishing up working on completing some plots while Mike created our UML diagram and additional functionality for our controllers. Again, I can't say enough at how well this project went. It was a great team effort!"
		},
		{
		"date": "07/20/2015",
		"title": "Week 7 Day 35",
		"text": "Design Patters and Project Presentation: We presented our project and overall this went very well. We got some great feedback on our code (make our functions smaller, stuff like that). We then dove head first into design patters and Ben gave me my favorite lecture to date. We learned about the Observer Pattern, Factory Patter and Dependency Injection, the Proxy Pattern, and finally the Observer Pattern. Really great stuff. He then gave us a project to use these with a Mobile News Feed Project where we had to create a console application that would take in news feeds and on content update, they would send notifications to our phones. We also learned about anti-Design Patters and code smells and what to avoid with writing some of our code. Great day!"
		},
		{
		"date": "07/21/2015",
		"title": "Week 7 Day 36",
		"text": "Time Complexity and Mobile News Feed: We worked on our design patters for our mobile news feed site as each pattern we learned about had to be incorporated in our design. We then started learning about time complexity for various data types and performance of our program. We learned how to spot polynomial time complexity and constant time complexity within our programs. Ben showed us some ways to time our functions and also briefly discussed parallelization and concurrency. We were given 3 sorting algorithms and we have to analyze their time complexity by tomorrow. The sorting algoritms are merge sort, quick sort and insertion sort."
		},
		{
		"date": "07/22/2015",
		"title": "Week 7 Day 37",
		"text": "More Time Complexity and new Data Structures: Another interesting day filled with lectures and working on our design patterns. We went over our assignment from the previous day and disussed why the merge sort had a time complexity of O(n log n). We then discussed staquest and queues and tree(binary trees mostly). We briefly discussed breadth first and depth first search and then we discussed linked lists, sorted lists, dictionaries, and hash sets. It was a lot of lectures which we filled in with more time to work on our design patters."
		},
		{
		"date": "07/23/2015",
		"title": "Week 7 Day 38",
		"text": "Present Design Patter Project and more Time Complexity: We went over the time complexity assignment given to us yesterday where we had to evaluate different time complexities for various data types(i.e. insert or removal for a sorted list) and then we presented our design pattern project for the mobile news server and were given constructive feedback on our project. I was off on my observer pattern as I didn't use the built in C# commands which was okay but I did not create my event handlers in the correct observer form. We were then given a lecture on concurrency topics and locks in general and specifically in c#. We learned about threading and using the Task.Run function as well as using async calls to run multiple c# asynchronously. Again, very interesting. We learned more about locks and how to avoid race conditions and deadlock conditions and then were given another project about TCPListners which my brain is too fried to work on right now so I will discuss that tomorrow."
		},
		{
		"date": "07/24/2015",
		"title": "Week 7 Day 39",
		"text": "Today was mostly spent on working on our concurrency server project, finishing up our testing for the week and getting us to look ahead to next week for our new Project. Our concurrency project involed setting up TCPListeners and TCPClients to build stacks and queues that the user can interact with. We have to figure out a way to use locks so that only two users can interact with our public stacks at a time. There was something called a private stack that the user could build. Luckily this project isn't required to have done by the end of the day as our main focus next week will be our new project and given what we learned over the course of the week our instructor let us focus our efforts on those. Testing went terribly but I learned some valuable things (like how to create a binary search tree and more about linked lists). Then we had a nice presentation about SalesForce to get us thinking for our topic for next week."
		},
		{
		"date": "07/27/2015 - 7/31/2015",
		"title": "Project MVC.Net & SalesForce",
		"text": "Our new task was given today to develop a Web Application using MVC.net that would integrate with the SalesForce CRM platform. The project needs to have OAuth2 Authentication for logging in to our site (so say logging in with a Google Account) and then it needs some special functionality that we give it to make it useful for a customer. Man, this is going to be tough. Most of my first day was spent watching tutorials on MVC.net to learn how the framework works and exploring SalesForce and how that works. The rest of the day was thinking of ideas for our project and learning about OAuth2 authentication. My idea is going to be creating a RaceStarter application where volunteers can sign up to help at various charity 5k,10k,half marthaton, marathon races and organizers can use this to help plan. I spent the night researching Twilio which has an API which will allow me to send text messages when users have questions or volunteer for a race(that is my special coolness I'm adding). I was successfully able to get that functionality working last night. On Tuesday, I spent the day finalizing my tutorials and ideas for my project as I ventured head first into what was a very frustrating day. Creating my models, views, and controllers, looked straightforward from my tutorials but every little bug I encountered (like correctly parsing Dates) seemed like it took me forever to fix. I feel like I'm getting a better handle on the functionality of the forms it creates and querying the data so at least that's a plus. Hopefully tomorrow I can pull all of this together."
		}
		
		
		
	]
}