{
	"entries":[
		{
		"date":"06/01/2015",
		"title":"First Day",
		"text":"Today was the first day of our code camp. We started off with general introductions. Our first lab focused on a python script using tweep from the twitter api. we discussed importing specific items from different python files. We created a new gmail account, a new google phone number, and a new twitter account,we were able to review some python script and modify it so it would send out tweets to our newly generated twitter page. Then we reviewed a second file so that it would take our file and tweet out random lines from our file. I learned not to use tab and to use spaces instead (I normally used tabs). I also learned how to stop the command line from running by using control-c.We then met to discuss source code control programs and that git would be our main program to use. We breifly touched on it and then were assigned a lab. I am struggling with using git and this lab. I have gotten the hang of initializing a repository(git init), changing a file, adding the file to be changed (git add),and then commiting a file (git commit). I have to figure out how to do it remotely yet and how to use Source Tree as that was a disaster also. Git is going to take some getting use to but I know it's a big deal. "
		},
		{
		"date":"06/02/2015",
		"title":"Second Day",
		"text":"Today was the first day of our code camp. We started off with general introductions. Our first lab focused on a python script using tweep from the twitter api. we discussed importing specific items from different python files. We created a new gmail account, a new google phone number, and a new twitter account, we were able to review some python script and modify it so it would send out tweets to our newly generated twitter page. Then we reviewed a second file so  that it would take our file and tweet out random lines from our file. I learned not to use tab and to use spaces instead (I normally used tabs). I also learned how to stop the command line from running by using control-c. We then met to discuss source code control programs and that git would be our main program to use. We breifly touched on it and then were assigned a lab. I am struggling with using git and this lab. I have gotten the hang of initializing a repository(git init), changing a file, adding the file to be changed (git add), and then commiting a file (git commit). I have to figure out how to do it remotely yet and how to use Source Tree as that was a disaster also. Git is going to take some getting use to but I know it's a big deal. "
		},
		{
		"date":"06/03/2015",
		"title":"Third Day",
		"text":"Today was mainly focused on building our dice game which I thought was awesome given how complex we made the rules.<br> We did two lectures focused on loops (for and while) and string manipulation. Seeing as how I had researched for in loops and while loops to work in my dice game this was a good review but I did learn a few different commands. The break and continue commands will be helpful. Continue will end a current iteration and jump back to the start of the while loop and run again. A break will end the while loop that you are currently in.<br> When dealing with string manipulation, I learned about using str.find() which find the first occurrence of an item. strings.lstrip, .strip, .rstrip remove whitespace from a string (strip will remove it from both sides) None of them remove whitespace from the middle of the string inside of the quotes. I didn't know about the  .startswith and .endswith functions. The .replace function will replace all occurrences of a string which I thought was interesting. I also learned that these functions do not modify the item we are running it on, but create a new string for each which we can store in another variable.<br> In my dice game, I've learned mainly about loops, string formatting, and how to return information in functions. String formatting command is simply {}.format(my variables I want to replace).  Here is an example: {0:15}{1:^15}{2:^15}.format(player[0],player[3],player[4]) I tried calling the same function within itself but it doesn't seem like it will work, but I'll keep trying. <br> I've also learned I can get lost in my own code so I need to make smaller chunks of code and document it better and name my variables better because there were a couple of times I really had to think as to what I was doing.<br> Debugging is also a pain trying to go through the game many, many times and figure out it it actually works for all situations. Printing out each and every step helps alot.<br> Today was a satisfying day for me because I felt like I broke through and mainly completed my game. There was a  point where I wanted to just say good enough and stop, but I took a break and re-focused and broke through that barrier.<br> I'm excited to see my finished product tomorrow."
		},
		{
		"date":"06/04/2015",
		"title":"Forth Day",
		"text":"Morning - Finished up the lab from last night and re-did the modular arithmetic problem.<br> The problem asked to output YUP if an inputed number divided by 10 was within 2 of a number that ended in 0. Because of how floating points work,  when decimal numbers were added, I was getting incorrect results. By importing the Decimal module and creating decimal types for my numbers, I was able to make the precision less and the program worked.<br> We learned about functions with our normal lecture and were then asked to create a function to calculate our pay for a given week based on user inputed hours and pay rate. The function asks us to use overtime hours in our calculation. I was able to use successfully for the first time the try except and have it run repeatedly by re-asking for the user values and return the raw_input function on the except. I was also able to format the function to two decimal places by using the {0:.2f}.format(total_pay) (total pay was my variable which stored my total_pay). The 0 is the placeholder spot for total_pay and the .2f tells .format to go to 2 decimal places and make it a float.<br> I was able to work my own project for a bit concerning my data science goal by making a python program that will output the number of degrees of freedom from a directed graph. Hopefully, I'll get to work on this some more as the class proceeds.<br> The afternoon was spent working on a dice game we created as a group and then individually, we were sent to make a program for it. so far my biggest lessons is using a for in loop over a list. Storing each players information as a list has been helpful. Also, I created a DICE list storing each die we use and giving that to each player. This was a mistake because when I updated each player's dice list, it updated all of the players so I had to make sure each player had their own individual list. We did not make this game easy on our selves because we have to keep track of scores assigned to the dice during the game. This is challenging.<br> Finally, when committing to git hub I need to remember that if I create a READ ME file from adding a repository on git hub, I need to first pull the repository or clone it to my local spot and then push it. Also when adding the remote repository I need to make sure to use the command git remote add origin  url where url is the location of my git hub remote repository.<br> I have a feeling I will be working on this program a bit tonight so my night isn't over yet!<br> "
		},
		{
		"date":"06/05/2015",
		"title":"Fifth Day",
		"text":"Today was focused more on reinforcement and reflection. We had more time to finish our dice game and I was ableto finish up debugging for my computer player.<br>  One major tool I learned today was concerning list comprehensions. I was happy to learn about the enumerate function which creates a list mapping our values to different indexes which when used with list comprehensions make it easy for me to get multiple max or min values from my lists. List comprehensions allowed me to create lists in single lines of code rather than multiple blocks.<br> We had a lecture on Google searching and this was helpful to know what a more efficient way to was to search in Google. It was interesting to know that the simpler we keep our search terms the better results we will get.<br> We reviewed our labs today to verify they were correct. Andrew reminded me about the split command. I can use this to break apart an email address and then verify it's in the correct format. Also I could have validated the first letter for a character rather than making sure it wasn't a digit, but either way worked fine.<br> We did a whiteboard challenge called fizz buzz. I forgot to use modular division at first instead of integer division but Andrew let me work through it and I finished the problem.<br> Main point driven home today is simpler, more modular codes put inside smaller functions to help me develop smarter and easier to debug code.<br> I finished Lab 4 on Loops with nothing too new to go over as most of what we have done were involved in our Dice Game."
		}
	]
}